Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: བཞོན་པ་མགྱོགས་པས་རྒྱལ་པོའི་ཕོ་བྲང་གི། །རྒྱལ་པོའི་ཁབ་ཏུ་མྱུར་དུ་བཀྲི་བར་བྱ། །
en: Then I will quickly bring the princes To the royal capital and into the royal palace.

source: དེ་དག་རྣམས་ནི་བསྐྱེད་པའི་མ་ཡི་སྙིང་། །མྱ་ངན་མེ་ཡིས་གས་པར་འགྱུར་དུ་འོང་། །
en: “ ‘ “The heart of their mother, who gave them birth, May break because of the fire of her grief.

source: བུ་གཉིས་མཐོང་ནས་ཞི་བ་ཐོབ་འགྱུར་ཏེ། །སྲོག་དང་བྲལ་བར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: She will attain peace from seeing her two sons, And then she will not lose her life.”

source: རྒྱལ་པོ་བློན་པོའི་ཚོགས་ཀྱིས་ཡོངས་བསྐོར་ནས། །གླང་ཆེན་ཞོན་ཏེ་བུ་རྣམས་བལྟ་ཕྱིར་སོང་། །
en: “ ‘The king, accompanied by his ministers, Riding an elephant, went to see that place.

source: བུ་གཉིས་སྙིང་རྗེའི་སྐད་ཀྱིས་རབ་ངུ་ཞིང་། །ནུ་བོའི་མིང་འབོད་ལམ་ནས་འོང་བ་མཐོང་། །
en: He saw his two sons coming along the road, weeping, With pitiful cries calling the name of their younger brother.

source: རྒྱལ་པོས་བུ་དེ་གཉིས་ནི་ཁྲིད་ནས་སུ། །རབ་ཏུ་ངུ་ཞིང་ཁྱིམ་དུ་སོང་ནས་ནི། །
en: “ ‘The king collected those two sons; Weeping, they went to their home.

source: དེ་ཡིས་སྐྱེན་པར་ལ་གོར་མྱུར་དུ་ཡང་། །བཙུན་མོ་ལ་ནི་རང་གི་བུ་རྣམས་བསྟན། །
en: In that way he was able to quickly, speedily Show the queen her own two sons.

source: ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་ང་། །སྔོན་གྱི་རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་ཡི། །བུ་དེ་སེམས་ཅན་ཆེན་པོ་མཆོག་གྱུར་ཅིང་། །གང་གིས་སྟག་མོ་བདེ་བར་བྱས་པ་ཡིན། །
en: “ ‘In the past, I, Śākyamuni, the Tathāgata, Was that excellent Mahāsattva, Who was the son of King Mahāratha That brought happiness to the tigress.

source: རྒྱལ་པོའི་དབང་པོ་དམ་པ་ཟས་གཙང་ནི། །ཤིང་རྟ་ཆེ་ཞེས་བྱ་བའི་རྒྱལ་པོར་གྱུར། །
en: “ ‘The excellent lord of kings, Śuddhodana, Was the king who was named Mahāratha.

source: བཙུན་མོའང་བཙུན་མོ་དམ་པ་སྒྱུ་མར་གྱུར། །
en: The queen was the excellent Queen Māyā.

source: སྒྲ་ཆེན་པོ་ནི་བྱམས་པར་གྱུར་པ་ཡིན། །
en: Mahāpraṇāda was Maitreya.

source: རྒྱལ་བུ་ལྷ་ཆེན་པོ་ཡང་དེ་བཞིན་དུ། །དེ་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཡིན། །
en: “ ‘Similarly, Prince Mahādeva Was Mañjuśrī Kumārabhūta.

source: སྟག་མོར་གྱུར་པ་སྐྱེ་དགུའི་བདག་མོ་ཆེ། །སྟག་ཕྲུག་རྣམས་ནི་དགེ་སློང་ལྔ་པོར་གྱུར། །
en: The tigress was Mahāprajāpatī, And the tiger cubs were the five bhikṣus.

source: དེ་ནས་རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་དང་བཙུན་མོས་སྙིང་རྗེ་བར་སྨྲེ་སྔགས་རྣམ་པ་མང་པོ་བཏོན་ནས། རྒྱན་ཐམས་ཅད་བཀྲོལ་ཏེ་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དང་ལྷན་ཅིག་ཏུ་བུའི་རུས་པ་ལ་མཆོད་པ་བྱས་ནས།
en: “ ‘Then King Mahāratha and the queen, wailing pitifully many times, removed their jewelry and, together with a great gathering of people, made offerings to the bones of their son.

source: སེམས་ཅན་ཆེན་པོ་དེའི་རུས་པ་དེ་དག་ས་ཕྱོགས་འདི་ཉིད་དུ་བཞག་སྟེ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་འདི་བྱས་སོ། །
en: The bones of Mahāsattva they placed in this area, and they constructed this stūpa of seven precious materials.

source: སེམས་ཅན་ཆེན་པོ་འདིས་སྟག་མོ་ལ་ལུས་ཡོངས་སུ་བཏང་ནས་ལུས་ཡོངས་སུ་བཏང་བ་འདིས་ཕྱིས་མ་འོངས་པའི་དུས་བསྐལ་པ་བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པ་རྣམས་སུ་ཡང་། སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱའོ། །ཞེས་སྨོན་ལམ་འདི་སྐད་བཏབ་བོ། །
en: “ ‘This Mahāsattva, having given his body to the tigress, prayed, “Through this gift of my body, may I afterward, in a future time, after countless eons have passed, accomplish the deeds of a buddha for beings.” ’

source: བསྟན་པ་འདི་བཤད་པ་ན་ལྷ་དང་མིར་བཅས་པའི་སྐྱེ་དགུའི་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: “When this teaching was given, countless, innumerable beings, including humans and devas, developed the aspiration to attain the highest, most complete enlightenment.

source: མཆོད་རྟེན་འདི་འདིར་བསྟན་པའི་རྒྱུ་ནི་འདི་ཡིན་ནོ། །རྐྱེན་ནི་འདི་ཡིན་ནོ། །
en: “This was the cause and condition for the appearance of that stūpa.

source: མཆོད་རྟེན་དེ་ཡང་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ས་དེ་ཉིད་ཀྱི་ནང་དུ་ཞུགས་སོ། །
en: Then, through the blessing of the Buddha, the stūpa went back down into the ground.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། སྟག་མོ་ལ་ལུས་ཡོངས་སུ་བཏང་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅྭ་བརྒྱད་པའོ།། །།
en: This concludes “The Gift of the Body to a Tigress,” the eighteenth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དེ་དག །
en: Chapter 19: Praise by All Bodhisattvas Then those hundreds of thousands of bodhisattvas went to where the Tathāgata Suvarṇa­ratnākaracchatra­kūṭa was.

source: དེ་བཞིན་གཤེགས་པ་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: When they arrived, they bowed down their heads to the feet of the Bhagavat Tathāgata Suvarṇa­ratnākaracchatra­kūṭa and arranged themselves to one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དེ་དག་གིས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་དེ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །རྒྱལ་བའི་སྐུ་མདོག་བཙོ་མའི་གསེར་འདྲ་སྟེ། །སྐུ་ལུས་གསེར་གྱི་མདོག་ཏུ་རྣམ་པར་གདའ། །གསེར་གྱི་རི་དབང་ལྟ་བུའི་གསེར་གྱི་མདོག །
en: Having arranged themselves to one side, those hundreds of thousands of bodhisattvas placed their palms together and praised the Tathāgata Suvarṇa­ratnākaracchatra­kūṭa with these verses: “The color of the Jina’s body is like refined gold; Your body is completely the color of gold, A golden color like a golden lord of mountains.

source: ཐུབ་པ་པདྨ་དཀར་པོ་གསེར་མདོག་ཅན། །
en: You are a muni, a white lotus, the color of gold.

source: བཟང་པོའི་མཚན་གྱིས་སྐུ་ལུས་རབ་ཏུ་བརྒྱན། །དཔེ་བྱད་སྣ་ཚོགས་བཟང་པོས་སྐུ་ལུས་སྤྲས། །
en: “Your body is adorned by the excellent signs; Your body is beautified by the various excellent features.

source: གསེར་གྱི་འོད་ལྟར་མཛེས་པ་རྣམ་པར་འབར། །
en: You are shining with beautiful golden light.

source: ཤིན་ཏུ་དྲི་མེད་ཞི་བ་རི་དབང་འདྲ། །
en: You are stainless and peaceful like the lord of mountains.

source: ཚངས་པའི་སྒྲ་དང་སྒྲ་སྙན་ཚངས་པའི་དབྱངས། །
en: “You have Brahmā’s voice, the beautiful voice of Brahmā.

source: སེང་གེའི་སྒྲ་དང་འབྲུག་སྒྲ་བསྒྲགས་པའི་དབྱངས། །
en: You have the roar of a lion, a voice of resounding thunder.

source: ཡན་ལག་དྲུག་ཅུ་བསྒྲགས་སྒྲ་དྲི་མེད་སྒྲ། །
en: You have the voice with sixty qualities, a stainless voice.

source: རྒྱལ་དབྱངས་རྨ་བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ། །
en: You have a jina’s voice, the peacock and the kalaviṅka’s sound.

source: ཤིན་ཏུ་དྲི་མེད་དྲི་བྲལ་གཟི་འོད་མཛེས། །
en: “You have completely stainless, immaculate, beautiful, bright light.

source: རྒྱལ་བ་བསོད་ནམས་བརྒྱ་པའི་མཚན་གྱིས་བརྒྱན། །
en: You are a jina adorned by the signs of a hundred qualities.

source: མཁྱེན་པའི་རྒྱ་མཚོ་དྲི་མེད་དྲི་བྲལ་མཆོག །
en: Your ocean of wisdom is stainless, perfectly free of stain.

source: རྒྱལ་བ་ཡོན་ཏན་ཀུན་ལྡན་རི་རབ་འདྲ། །
en: You are a jina like Sumeru, endowed with all qualities.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པར་ཐུགས་བརྩེ་མཆོག །
en: “You have the supreme compassion for benefiting beings.

source: འཇིག་རྟེན་དག་ན་བདེ་བ་སྦྱིན་པའི་མཆོག །
en: You are the supreme bringer of happiness to the worlds.

source: རྒྱལ་བ་དམ་པའི་དོན་རྣམས་སྟོན་པ་སྟེ། །
en: You are a jina who teaches the sublime meaning.

source: མྱ་ངན་འདས་པའི་བདེ་ལ་འཛུད་པ་ལགས། །
en: You are a guide toward the bliss of nirvāṇa.

source: འཆི་བ་མེད་པའི་བདེ་བ་སྩོལ་བ་སྟེ། །རྒྱལ་བ་བདུད་རྩིའི་ཆོས་ནི་རབ་ཏུ་སྟོན། །འཆི་བ་མེད་པའི་གྲོང་ཁྱེར་འཛུད་པ་སྟེ། །
en: “You bestow the bliss of deathlessness; You are a jina who teaches the Dharma of deathlessness; You are a guide for the city of deathlessness.

source: བདེ་བ་ཀུན་གྱི་འབྱུང་གནས་བདེ་བའི་གནས། །
en: You are the source of all happiness, the basis of happiness.

source: རྒྱལ་བས་འགྲོ་བ་སྡུག་བསྔལ་ཐར་བར་མཛོད། །སྡུག་བསྔལ་རྒྱ་མཚོ་ལས་ནི་སྐྱེ་དགུ་སྒྲོལ། །
en: “You are a jina who frees beings from suffering; You liberate beings from the ocean of suffering.

source: ཞི་བའི་ལམ་ལ་སྐྱེ་དགུ་རབ་ཏུ་འཛུད། །
en: You lead beings on the path to peace.

source: སྐྱེ་དགུ་རྣམས་ལ་བདེ་བ་ཀུན་སྩོལ་བ། །
en: You bestow all happiness upon beings.

source: ཁྱོད་ལ་དཔེ་ནི་བགྱི་བར་མི་ནུས་ཏེ། །
en: “There is no analogy that will serve for you.

source: ཇི་སྙེད་འདྲེན་པའི་ཡོན་ཏན་ཡེ་ཤེས་མཚོ། །
en: You are an ocean of wisdom with the qualities of all guides.

source: སྲོག་ཆགས་ཀུན་ལ་ཁྱོད་ཀྱི་ཐུགས་རྗེ་དང་། །བྱམས་པའི་སྟོབས་དང་ཐབས་དང་བརྩོན་འགྲུས་དང་། །
en: You have the power, methods, and diligence Of compassion and love for all beings.

source: ཁྱོད་ཀྱི་ཡོན་ཏན་ཡེ་ཤེས་རྒྱ་མཚོ་ལས། །བསྐལ་པ་བྱེ་བ་སྟོང་ཕྲག་མང་པོར་ཡང་། །ཡོན་ཏན་ཐིགས་པ་གཅིག་ཙམ་རབ་བསྟན་པར། །ལྷར་བཅས་འགྲོ་བའི་ནང་ན་ནུས་མ་མཆིས། །
en: “There is no one among beings, including devas, Who even in thousands of millions of eons Would be able to teach even one drop of the qualities From your ocean of wisdom and qualities.

source: ཡོན་ཏན་མཚོ་ལས་ཡོན་ཏན་ཐིགས་བླངས་ཏེ། །དེ་ལྟར་བདག་གིས་མདོར་བསྡུས་ཅུང་ཟད་བཤད། །
en: “I have taken a drop of qualities from the ocean of your qualities And in that way have taught a little of it briefly.

source: བདག་གིས་བསོད་ནམས་གང་བསགས་དེ་ཡིས་ནི། །སེམས་ཅན་དེ་དག་བྱང་ཆུབ་མཆོག་རེག་ཤོག །
en: Through whatever merit I have accumulated, May those beings reach the supreme enlightenment.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བསྟོད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་དགུ་པའོ།། །།
en: This concludes “Praise by All Bodhisattvas,” the nineteenth chapter of “The Lord King of the Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ། །ཐུབ་དབང་ཁྱོད་ནི་བསོད་ནམས་བརྒྱ་པའི་མཚན། །དཔལ་སྟོང་མཛེས་པའི་ཡོན་ཏན་རྣམས་ཀྱིས་བརྒྱན། །
en: Chapter 20: The Praise of All Tathāgatas Then the bodhisattva Ruciraketu rose from his seat and, with his upper robe over one shoulder, knelt on his right knee with palms together, bowed toward the Bhagavat, and then praised the Bhagavat through these verses: “Lord of munis, you have the signs of a hundred merits; You are adorned by the qualities of a thousand beautiful splendors.

source: ཁ་དོག་རྒྱ་ཆེན་མཆོག་ཏུ་ཞི་བ་སྟོན། །ཉི་མ་སྟོང་ལྟར་འོད་ནི་རྣམ་པར་འཕྲོ། །
en: You have an exalted color, you manifest supreme peace, And you shine with light like a thousand suns.

source: འོད་ཟེར་དུ་མ་འབར་བས་འོད་ཀྱིས་ཁྱབ། །ཁ་དོག་སྣ་ཚོགས་དང་བས་རིན་ཆེན་འདྲ། །སྔོན་པོ་དཀར་པོ་གསེར་འོད་བཻ་ཌཱུརྱ། །ཟངས་དང་སྐྱ་རེངས་ཤེལ་གྱི་འོད་ལྟ་བུས། །
en: “You pervade with light by radiating numerous light rays Filled with various colors, so that you resemble a jewel; You have blue, white, golden, and beryl lights, And lights like copper, the dawn, and crystals.

source: རྡོ་རྗེ་རི་དབང་རི་རབ་ཐལ་མཛད་ཅིང་། །ཞིང་རྣམས་བྱེ་བ་དུ་མར་སྣང་མཛད་དེ། །སྡུག་བསྔལ་མི་བཟད་དྲག་པོ་ཞི་བར་མཛད། །བདེ་བ་མཆོག་གིས་སེམས་ཅན་ཚིམ་པར་མཛད། །
en: “They reach the vajra mountain, lord of mountains, Sumeru, And they illuminate numerous millions of realms And bring to an end fierce, terrible suffering, And bring perfect happiness that satisfies beings.

source: མདོག་དང་དབང་པོ་གསལ་བག་བལྟ་ན་མཛེས། །
en: “You have a bright color and sense organs that are beautiful to behold.

source: གཟུགས་བལྟས་མི་ངོམས་སྐྱེ་བོས་བལྟ་ན་དགའ། །
en: Beings delight to see you and never tire of looking at your body.

source: རྨ་བྱའི་མདོག་འདྲའི་དབུ་སྐྲ་རྣམ་པར་མཛེས། །བུང་བ་མང་པོས་གང་བའི་འོད་དང་འདྲ། །
en: Your hair is so beautiful and has the colors of a peacock, Gleaming as if it were a mass of numerous bees.

source: ཐུགས་རྗེ་རྣམ་དག་ཡོན་ཏན་རྣམས་ཀྱིས་བརྒྱན། །
en: “You are adorned by the qualities of completely pure compassion.

source: ཏིང་འཛིན་བྱམས་པ་བསོད་ནམས་དམ་པ་བསགས། །
en: You have an accumulation of sublime samādhi, love, and merit.

source: དཔེ་བྱད་བཟང་དང་ཁ་དོག་སྣ་ཚོགས་ལྡན། །
en: You are endowed with the various excellent features and colors.

source: ཏིང་འཛིན་བྱང་ཆུབ་ཡན་ལག་ཡོན་ཏན་བརྒྱན། །
en: You are adorned by the qualities of samādhi and enlightenment.

source: ཁྱོད་ནི་རབ་ཏུ་ཚིམ་མཛད་ཕན་པ་མཛད། །བདེ་མཛད་བདེ་བ་ཀུན་གྱི་འབྱུང་གནས་འབྱུང་། །
en: “You bring complete satisfaction and bring benefit; You bring happiness and bring the source of all happiness.

source: ཡོན་ཏན་ཟབ་མོ་སྣ་ཚོགས་རྣམས་ཀྱིས་བརྒྱན། །ཞིང་རྣམས་བྱེ་བ་དག་དུ་ལྷང་ངེ་སྟེ། །
en: You are adorned by various profound qualities, And you brighten millions of realms.

source: མེ་ཡི་འོད་ལྟར་འོད་ཟེར་རྣམས་ཀྱིས་མཛེས། །ཇི་ལྟར་ནམ་མཁར་ཉི་དཀྱིལ་རྫོགས་པ་བཞིན། །
en: “You are beautified by light rays that are like firelight; You are like the complete disk of the sun in the sky.

source: རི་རབ་ལྟ་བུར་ཡོན་ཏན་ཀུན་ལྡན་པར། །འཇིག་རྟེན་ཁམས་རྣམས་ཀུན་ཏུ་རབ་ཏུ་གདའ། །
en: You possess all qualities, like Mount Sumeru, And you appear throughout all world realms.

source: བ་ཞོ་ཀུ་མུ་ད་དུང་ཟླ་འདྲ་ཞིང་། །ཁ་བའི་མདོག་དང་དཀར་པོ་བཟང་འདྲ་བའི། །ཚེམས་ཀྱི་ཕྲེང་བས་ཁྱོད་ཀྱི་ཞལ་མཛེས་པ། །ངང་པའི་རྒྱལ་པོ་བར་སྣང་ཇི་བཞིན་ནོ། །
en: “Your face is made beautiful by the rows of your teeth That are like cow curd, white water lilies, and the moon; They have an excellent whiteness, like the color of snow, And resemble the kings of geese in the sky.

source: ཁྱོད་ཀྱི་ཞི་ཞལ་མཚམས་ནས་ཟླ་བ་འདྲ། །གཡས་སུ་འཁྱིལ་ཞིང་ཁོང་ཆུད་འདྲ་བ་ལགས། །
en: “A hair like white beryl curls to the right, Within your peaceful, moon-like face.

source: བཻ་ཌཱུརྱ་འདྲའི་སྤུ་འོད་དཀར་རྣམས་ཀྱིས། །ནམ་མཁའི་དཀྱིལ་ན་ཉི་མ་ལྟ་བུར་མཛེས། །
en: Its white light is as beautiful As the sun in the middle of the sky.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བསྟོད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ཉི་ཤུ་པའོ།། །།དེ་ནས་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པས།
en: This concludes “The Praise of All Tathāgatas,” the twentieth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་བསྟོད་པ། རྣམ་པར་དག་པའི་ཆོས་ལ་སྤོབས་པའི་བློ་མངའ་བ། །ལས་ངན་ལམ་དང་བྲལ་བའི་བདག་ཉིད་བློ་མངའ་ཞིང་། །སྲིད་དང་སྲིད་མིན་མཁྱེན་པ་རྣམ་དག་བློ་མངའ་བ། །སངས་རྒྱས་རྣམ་དག་བློ་མངའ་བ་ལ་ཕྱག་འཚལ་ལོ། །
en: Chapter 21: The Conclusion Then the noble goddess Bodhisattvasamuccayā praised the Bhagavat with these verses: “I pay homage to the Buddha who has pure knowledge, Who has the knowledge with eloquence in the pure Dharma, Who has the knowledge that is free from the path of bad actions, And has the pure knowledge of existence and nonexistence.

source: ཀྱེ་མའོ་ཀྱེ་མའོ་སངས་རྒྱས་གཟི་བརྗིད་མཐའ་ཡས་ཏེ། །
en: “Oh! Oh! The Buddha’s magnificence is infinite! Oh!

source: ཀྱེ་མའོ་ཀྱེ་མའོ་རྒྱ་མཚོ་དང་ནི་རི་རབ་འདྲ། །
en: Oh! He is like the ocean and Mount Sumeru! Oh! Oh!

source: ཀྱེ་མའོ་ཀྱེ་མའོ་སངས་རྒྱས་སྤྱོད་ཡུལ་མཐའ་ཡས་ཏེ། །
en: The Buddha’s activity is infinite!

source: ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་བཞིན་དུ་ཤིན་ཏུ་དཀོན། །
en: He is extremely rare like a fig tree flower!

source: སེམས་ཅན་དག་ནི་ཐམས་ཅད་རྗེས་སུ་གཟུང་སླད་དུ། །གང་གིས་མདོ་སྡེ་དམ་པ་འདི་འདྲ་རབ་གསུངས་པ། །མི་དབང་ཉི་མ་ཤཱཀྱའི་དབང་པོའི་རིགས་ཀྱི་ཏོག །
en: “In order that he may care for all beings, He has taught such a sublime sūtra as this.

source: ཀྱེ་མའོ་ཀྱེ་མའོ་དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ལྡན། །
en: Oh! Oh!

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་ཐུབ་པ་དབང་པོ་ཞི། །ཞི་བའི་དམ་པ་ཞི་བའི་གྲོང་ཁྱེར་རབ་ཏུ་ཞུགས། །ཏིང་འཛིན་ཟབ་ཅིང་ཞི་ལ་རྡུལ་དང་བྲལ་བ་ནི། །
en: The Tathāgata who has compassion, The lord of humans, the sun, the Śākya family’s crest— “The Tathāgata Śākyamuni is the lord of peace; He resides in sublime peace in the city of peace; His profound samādhi is a peace free of stain.

source: རྒྱལ་བ་སངས་རྒྱས་སྤྱོད་ཡུལ་དེར་ཡང་རབ་ཏུ་ཞུགས། །
en: He has entered the field of activity of the buddhas, the jinas.

source: དེ་ལྟར་ཉན་ཐོས་རྣམས་ཀྱི་ལུས་ནི་སྟོང་པ་སྟེ། །རྐང་གཉིས་དམ་པ་རྣམས་ཀྱི་གནས་པའང་སྟོང་པ་ལགས། །
en: “In that way, the bodies of the disciples are empty; The locations of the supreme among humans are empty.

source: ཆོས་རྣམས་དེ་དག་ཐམས་ཅད་རང་བཞིན་སྟོང་ལགས་ན། །སེམས་ཅན་རྣམས་ནི་སྟོང་པའི་བདག་ཉིད་མ་འཚལ་ཏོ། །
en: All of those phenomena are by nature empty, But beings do not understand that empty nature.

source: རྟག་པ་ཐེར་ཟུག་ཏུ་ནི་རྒྱལ་བ་དྲན་པར་བགྱིད། །རྒྱལ་བ་མཐོང་བར་ཡང་ནི་རྟག་ཏུ་མྱ་ངན་བགྱིད། །
en: “I always, constantly think of the Buddha; I constantly grieve for the sight of the Jina.

source: རྫོགས་པའི་སངས་རྒྱས་ཉི་མ་མཐོང་བར་བགྱིད་སླད་དུ། །རྟག་པར་ཡང་ནི་སྨོན་ལམ་རབ་ཏུ་འདེབས་པར་བགྱིད། །
en: I am constantly praying and supplicating In order to see the sun that is the perfect Buddha.

source: བདག་ནི་རྟག་ཏུ་དོག་སར་པུས་མོ་བཙུགས་ནས་སུ། །རྒྱལ་བའི་གཟུགས་ཀྱིས་སྐོམ་པའི་མྱ་ངན་རབ་ཏུ་སེམས། །
en: “I constantly kneel in one narrow spot, My mind pained by thirsting for the Jina’s form.

source: འདྲེན་པའི་སླད་དུ་སྙིང་རྗེའི་སྐད་ཀྱིས་ངུ་བར་བགྱིད། །བདག་ནི་བདེ་བར་གཤེགས་པ་མཐོང་བར་རབ་ཏུ་སྐོམ། །
en: I weep and call out pitifully for the Guide, In extreme thirst for the sight of the Tathāgata.

source: མྱ་ངན་མེ་ཡིས་ཀུན་ཏུ་རབ་ཏུ་འབར་བར་གྱུར། །
en: “I am completely burned by the fire of my grief.

source: མཐོང་བའི་ཆུ་བསིལ་བདག་ལ་རྟག་པར་སྩལ་དུ་གསོལ། །
en: I pray you always give me the cooling water of your sight.

source: བདག་ནི་ཁྱོད་ཀྱི་གཟུགས་ལ་བལྟ་བས་རབ་ཏུ་སྐོམ། །
en: I am in extreme thirst for the sight of your form.

source: ཐུགས་རྗེའི་ཆར་གྱིས་བདག་ལ་རབ་ཏུ་སིམ་པར་མཛོད། །
en: Refresh me with the rain of your compassion.

source: འདྲེན་པ་ཁྱོད་ཀྱིས་བདག་ལ་ཐུགས་རྗེ་མཛད་དུ་གསོལ། །
en: “I pray that you, the Guide, will be compassionate to me.

source: ཞི་བའི་གཟུགས་མཐོང་བ་ནི་བདག་ལ་སྩལ་དུ་གསོལ། །
en: I pray that you bestow on me the sight of your peaceful form.

source: ཁྱོད་ནི་ལྷ་དང་བཅས་པའི་འགྲོ་བ་སྐྱོབ་པ་སྟེ། །འདི་ལྟར་ཉན་ཐོས་རྣམས་ཀྱི་ལུས་ནི་སྟོང་པ་ལགས། །
en: You are the savior of beings, including the devas, And thus the bodies of your disciples are empty.

source: སེམས་ཅན་ཐམས་ཅད་དག་ནི་རྨི་ལམ་རང་བཞིན་ཏེ། །
en: “All beings have the nature of a dream.

source: ནམ་མཁའ་འདྲ་ཞིང་ནམ་མཁའི་ངོ་བོ་ཉིད་ཀྱང་ལགས། །
en: They are like space and have the nature of space.

source: སྒྱུ་མ་སྨིག་རྒྱུ་དང་ནི་ཆུ་ཡི་ཟླ་བ་འདྲ། །
en: They are like illusions, mirages, and the moon on water.

source: འདྲེན་པ་ཁྱོད་ཀྱིས་སྟོང་པ་ཚེ་དང་ལྡན་པ་ལགས། །
en: Guide, yours is an emptiness of greatness.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་གདན་ལས་བཞེངས་ཏེ་ཚངས་པའི་སྒྲ་དབྱངས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་ལྷ་མོ་ཁྱོད་ལེགས་སོ་ཁྱོད་ཡང་ལེགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པ་དང་།
en: The Bhagavat then rose from his seat and with the voice of Brahmā said, “Noble goddess, well done!

source: ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་ལ་སོགས་པ་ལྷ་ཡི་བུ་མོ་དེ་དག་ཐམས་ཅད་དང་།
en: Well done!”

source: ལྷ་མོ་ཆེན་མོ་དཔལ་ལ་སོགས་པ་ལྷ་མོའི་ཚོགས་དེ་དག་ཐམས་ཅད་དང་། རྣམ་ཐོས་ཀྱི་བུ་ལ་སོགས་པ་ལྷའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་དང་། ལྷ་དང་། མི་དང་།
en: When the Bhagavat had spoken, the noble goddess Bodhisattvasamuccayā, the noble goddess Sarasvatī, and all the other goddesses—the noble goddess Śrī and all the rest of the entire assembly of goddesses—and Vaiśravaṇa and all the other kings of devas, and the assembly that had all the different kinds of disciples, and the world with its devas, humans, asuras, and gandharvas rejoiced and praised the words of the Bhagavat.

source: ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། མཇུག་བསྡུས་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ཉི་ཤུ་རྩ་གཅིག་པའོ།། །།
en: This concludes “The Conclusion,” the twenty-first chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: འཕགས་པ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: The Mahāyāna sūtra “The Lord King of Sūtras, the Sublime Golden Light” is concluded.

source: ཡེ་དྷ་རྨཱ་ཧེ་ཏུ་པྲ་བྷ་ཝཱ་ཧེ་དུནྟེ་ཥཱནྟ་ཐཱ་ག་ཏོ་ཧྱ་བ་ད་ཏ་ཏེ་ཥཱཉྩ་ཡོ་ནི་རོ་དྷ་ཨེ་བཾ་བཱ་དཱི་མ་ཧཱ་ཤྲ་མ་ཎ།​། །​།
en: ye dharmahetuprabhavā hetun teśān tathāgato hy avadat eśāñ ca yo nirodhā evaṃ vādī mahāśramanaḥ svāhā
